package org.example.lection_5;

public class Theory {
    /* Socket - двусторонний канал связи между двумя процессами,
       выполняющимися на разных машинах, и служит для обмена
       данными между ними.
       Основная цель использования Socket в java - это
       создание  клиент-серверных приложений, где сервер
       принимает запросы от клиентов, обрабатывает их и
       отправляет обратно ответ.
       Это может включать в себя различные сетевые приложения,
       такие как чаты, онлайн-игры, системы сообщений и многое другое.
       Кроме того, Socket позволяет взаимодействовать с различными
       протоколами, такими как HTTP, FTP и другими, обеспечивая
       гибкость и универсальность в разработке Java-приложений.
     */
    /*
       Порт - это идентификатор, который используется для связи
       между клиентом и сервером. Он определяет протокол, по которому
       будет происходить обмен данными, и адрес сервера, к которому
       нужно подключиться (указывается через ':', после IP-адреса).
       Порт - 16-битное число, т.е. всего 2^16 = 65536 портов на 1 IP-адрес,
       но порты 0-1023 зарезервированы операционной системой.
     */





}
